[Killed] MethodExpression
main/components/Nav/AppNavbar.js:11:10
   return (
     <>
       {
-        (currentUrl.startsWith("http://localhost:3000") || currentUrl.startsWith("http://127.0.0.1:3000")) && (
+        (currentUrl.endsWith("http://localhost:3000") || currentUrl.startsWith("http://127.0.0.1:3000")) && (
           <AppNavbarLocalhost url={currentUrl} />
         )
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] StringLiteral
main/components/Nav/AppNavbar.js:15:67
           <AppNavbarLocalhost url={currentUrl} />
         )
       }
-      <Navbar expand="xl" variant="dark" style={{backgroundColor: "#003660"}} sticky="top" data-testid="AppNavbar">
+      <Navbar expand="xl" variant="dark" style={{backgroundColor: ""}} sticky="top" data-testid="AppNavbar">
         <Container>
           <img data-testid="gauchoride-nav-logo" src={require('../../../assets/stork.png')} alt="" style={{width: 80, height: 80, marginRight: 15}} />
killedBy: AppNavbar tests background of AppNavbar is UCSB's navy color
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: rgb(0, 54, 96);

<html>
  <head />
