[Killed] StringLiteral
main/components/Users/UsersTable.js:74:17
     return <OurTable
         data={users}
         columns={buttonColumn}
-        testid={"UsersTable"}
+        testid={""}
     />;
 };
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
