[Killed] BlockStatement
main/components/Users/UsersTable.js:17:50
             }
         }
     }
-    function cellToAxiosParamsToggleDriver(cell) {
-        return {
-            url: "/api/admin/users/toggleDriver",
-            method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
-    }
+    function cellToAxiosParamsToggleDriver(cell) {}
     function cellToAxiosParamsToggleRider(cell) {
         return {
killedBy: AdminUsersPage tests usertable toggle driver tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:18:16
         }
     }
     function cellToAxiosParamsToggleDriver(cell) {
-        return {
-            url: "/api/admin/users/toggleDriver",
-            method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
+        return {}
     }
     function cellToAxiosParamsToggleRider(cell) {
killedBy: AdminUsersPage tests usertable toggle driver tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Users/UsersTable.js:26:49
             }
         }
     }
-    function cellToAxiosParamsToggleRider(cell) {
-        return {
-            url: "/api/admin/users/toggleRider",
-            method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
-    }
+    function cellToAxiosParamsToggleRider(cell) {}
 
     // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests usertable toggle rider tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Users/UsersTable.js:56:50
 
     // Stryker disable next-line all : TODO try to make a good test for this
     const toggleAdminCallback = async (cell) => { toggleAdminMutation.mutate(cell); }
-    const toggleDriverCallback = async (cell) => { toggleDriverMutation.mutate(cell); }
+    const toggleDriverCallback = async (cell) => {}
     const toggleRiderCallback = async (cell) => { toggleRiderMutation.mutate(cell); }
 
killedBy: AdminUsersPage tests usertable toggle driver tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Users/UsersTable.js:57:49
     // Stryker disable next-line all : TODO try to make a good test for this
     const toggleAdminCallback = async (cell) => { toggleAdminMutation.mutate(cell); }
     const toggleDriverCallback = async (cell) => { toggleDriverMutation.mutate(cell); }
-    const toggleRiderCallback = async (cell) => { toggleRiderMutation.mutate(cell); }
+    const toggleRiderCallback = async (cell) => {}
 
     const columns = [
killedBy: AdminUsersPage tests usertable toggle rider tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:86:9
             id: 'driver',
             accessor: (row, _rowIndex) => String(row.driver) // hack needed for boolean values to show up
         },
-        {
-            Header: 'Rider',
-            id: 'rider',
-            accessor: (row, _rowIndex) => String(row.rider) // hack needed for boolean values to show up
-        }
+        {}
     ];
    
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Users/UsersTable.js:89:23
         {
             Header: 'Rider',
             id: 'rider',
-            accessor: (row, _rowIndex) => String(row.rider) // hack needed for boolean values to show up
+            accessor: () => undefined // hack needed for boolean values to show up
         }
     ];
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] StringLiteral
main/components/Users/UsersTable.js:95:22
    
     const buttonColumn = [
         ...columns,
-        ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
+        ButtonColumn("", "primary", toggleAdminCallback, "UsersTable"),
         ButtonColumn("toggle-driver", "primary", toggleDriverCallback, "UsersTable"),
         ButtonColumn("toggle-rider", "primary", toggleRiderCallback, "UsersTable"),
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:96:22
     const buttonColumn = [
         ...columns,
         ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
-        ButtonColumn("toggle-driver", "primary", toggleDriverCallback, "UsersTable"),
+        ButtonColumn("", "primary", toggleDriverCallback, "UsersTable"),
         ButtonColumn("toggle-rider", "primary", toggleRiderCallback, "UsersTable"),
     ]
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:97:38
         ...columns,
         ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
         ButtonColumn("toggle-driver", "primary", toggleDriverCallback, "UsersTable"),
-        ButtonColumn("toggle-rider", "primary", toggleRiderCallback, "UsersTable"),
+        ButtonColumn("toggle-rider", "", toggleRiderCallback, "UsersTable"),
     ]
                
killedBy: UserTable tests ButtonColumn with primary style has the expected appearance
statusReason: Error: expect(element).toHaveClass("btn btn-primary")

Expected the element to have class:
  btn btn-primary
Received:
  btn
