[Killed] BooleanLiteral
main/components/Carts/CartTable.js:8:73
 import { useNavigate } from "react-router-dom";
 import { hasRole } from "main/utils/currentUser";
 
-export default function CartTable({ carts, currentUser, actionVisible = true }) {
+export default function CartTable({ carts, currentUser, actionVisible = false }) {
 
     const navigate = useNavigate();
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CartTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/Carts/CartTable.js:12:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/carts/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailCallback = (cell) => {
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/carts/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Carts/CartTable.js:16:38
         navigate(`/carts/edit/${cell.row.values.id}`)
     }
 
-    const detailCallback = (cell) => {
-        navigate(`/carts/detail/${cell.row.values.id}`)
-    }
+    const detailCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests detail page button test
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/carts/detail/1"

Number of calls: 0

<html>
  <head />
