[Killed] ArrowFunction
main/pages/Carts/CartCreatePage.js:9:31
 
 export default function CartCreatePage() {
 
-  const objectToAxiosParams = (cart) => ({
-    url: "/api/carts/post",
-    method: "POST",
-    params: {
-      name: cart.name,
-      capacityPeople: cart.capacityPeople,
-      capacityWheelchair: cart.capacityWheelchair
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (cart) => {
killedBy: CartCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Carts/CartCreatePage.js:19:31
     }
   });
 
-  const onSuccess = (cart) => {
-    toast(`New cart Created - id: ${cart.id} name: ${cart.name}`);
-  }
+  const onSuccess = (cart) => {}
 
   const mutation = useBackendMutation(
killedBy: CartCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New cart Created - id: 17 name: Cart1"

Number of calls: 0

[Killed] StringLiteral
main/pages/Carts/CartCreatePage.js:20:11
   });
 
   const onSuccess = (cart) => {
-    toast(`New cart Created - id: ${cart.id} name: ${cart.name}`);
+    toast(``);
   }
 
killedBy: CartCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New cart Created - id: 17 name: Cart1"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/Carts/CartCreatePage.js:36:18
     mutation.mutate(data);
   }
 
-  if (isSuccess) {
-    return <Navigate to="/carts/list" />
-  }
+  if (isSuccess) {}
 
   return (
killedBy: CartCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/carts/list"}

Number of calls: 0
