[Killed] BlockStatement
main/pages/Carts/CartDetailsPage.js:7:43
 import { useBackend } from "main/utils/useBackend";
 import { useCurrentUser } from 'main/utils/currentUser';
 
-export default function CartDetailsPage() {
-  let { id } = useParams();
-
-  const currentUser = useCurrentUser();
-
-  const { data: carts, error: _error, status: _status } =
-  useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    [`/api/carts/detail/${id}`],
-    { method: "GET", url: `/api/carts?id=${id}` },
-    []
-  );
-
-  
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Cart Details</h1>
-        <CartTable carts={[carts]} currentUser={currentUser} actionVisible={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function CartDetailsPage() {}
 
killedBy: CartDetailsPage tests loads the correct fields, and no buttons, not admin
statusReason: Error: CartDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/Carts/CartDetailsPage.js:16:27
   useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/carts/detail/${id}`],
-    { method: "GET", url: `/api/carts?id=${id}` },
+    { method: "GET", url: `` },
     []
   );
killedBy: CartDetailsPage tests loads the correct fields, and no buttons, not admin
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:


<html>

[Killed] ArrayDeclaration
main/pages/Carts/CartDetailsPage.js:17:5
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/carts/detail/${id}`],
     { method: "GET", url: `/api/carts?id=${id}` },
-    []
+    ["Stryker was here"]
   );
 
killedBy: CartDetailsPage tests useBackend params are correct
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: ["/api/carts/detail/3"], {"method": "GET", "url": "/api/carts?id=3"}, []
Received
       1
          ["/api/carts/detail/3"],
          {"method": "GET", "url": "/api/carts?id=3"},
        - Array []

[Killed] BooleanLiteral
main/pages/Carts/CartDetailsPage.js:25:77
     <BasicLayout>
       <div className="pt-2">
         <h1>Cart Details</h1>
-        <CartTable carts={[carts]} currentUser={currentUser} actionVisible={false} />
+        <CartTable carts={[carts]} currentUser={currentUser} actionVisible={true} />
       </div>
     </BasicLayout>
killedBy: CartDetailsPage tests loads the correct fields, and no buttons, admin user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="CartTable-cell-row-0-col-Detail-button" type="button">Detail</button> instead

[Killed] ArrayDeclaration
main/pages/Carts/CartDetailsPage.js:25:27
     <BasicLayout>
       <div className="pt-2">
         <h1>Cart Details</h1>
-        <CartTable carts={[carts]} currentUser={currentUser} actionVisible={false} />
+        <CartTable carts={[]} currentUser={currentUser} actionVisible={false} />
       </div>
     </BasicLayout>
killedBy: CartDetailsPage tests loads the correct fields, and no buttons, not admin
statusReason: Error: Unable to find an element by: [data-testid="CartTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
