[Killed] ObjectLiteral
main/pages/Carts/CartEditPage.js:15:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/carts?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/carts`,
-        params: {
-          id
-        }
-      }
+      {}
     );
 
killedBy: CartEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CartForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/Carts/CartEditPage.js:18:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/carts`,
-        params: {
-          id
-        }
+        params: {}
       }
     );
killedBy: CartEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CartForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Carts/CartEditPage.js:24:36
       }
     );
 
-    const objectToAxiosPutParams = (cart) => ({
-        url: "/api/carts",
-        method: "PUT",
-        params: {
-            id: cart.id,
-        },
-        data: {
-            name: cart.name,
-            capacityPeople: cart.capacityPeople,
-            capacityWheelchair: cart.capacityWheelchair
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (cart) => {
killedBy: CartEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Cart Updated - id: 17 name: some test name 19"

Number of calls: 0

[Killed] ObjectLiteral
main/pages/Carts/CartEditPage.js:24:47
       }
     );
 
-    const objectToAxiosPutParams = (cart) => ({
-        url: "/api/carts",
-        method: "PUT",
-        params: {
-            id: cart.id,
-        },
-        data: {
-            name: cart.name,
-            capacityPeople: cart.capacityPeople,
-            capacityWheelchair: cart.capacityWheelchair
-        }
-    });
+    const objectToAxiosPutParams = (cart) => ({});
 
     const onSuccess = (cart) => {
killedBy: CartEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Cart Updated - id: 17 name: some test name 19"

Number of calls: 0

[Killed] StringLiteral
main/pages/Carts/CartEditPage.js:25:14
     );
 
     const objectToAxiosPutParams = (cart) => ({
-        url: "/api/carts",
+        url: "",
         method: "PUT",
         params: {
killedBy: CartEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Cart Updated - id: 17 name: some test name 19"

Number of calls: 0

[Killed] BlockStatement
main/pages/Carts/CartEditPage.js:37:33
         }
     });
 
-    const onSuccess = (cart) => {
-        toast.success(`Cart Updated - id: ${cart.id} name: ${cart.name}`);
-    }
+    const onSuccess = (cart) => {}
 
     const mutation = useBackendMutation(
killedBy: CartEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Cart Updated - id: 17 name: some test name 19"

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Carts/CartEditPage.js:61:18
         <BasicLayout>
             <div className="pt-2 pb-3">
                 <h1>Edit Cart</h1>
-                {cart && 
-                <CartForm submitAction={onSubmit} buttonLabel="Update" initialContents={cart} /> 
+                {false 
                 }
             </div>
killedBy: CartEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CartForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Carts/CartEditPage.js:61:18
         <BasicLayout>
             <div className="pt-2 pb-3">
                 <h1>Edit Cart</h1>
-                {cart && 
-                <CartForm submitAction={onSubmit} buttonLabel="Update" initialContents={cart} /> 
+                {cart || <CartForm submitAction={onSubmit} buttonLabel="Update" initialContents={cart} /> 
                 }
             </div>
killedBy: CartEditPage tests when the backend doesn't return a todo renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="CartForm-name" id="name" name="name" type="text" /> instead
