[Killed] BlockStatement
main/pages/Carts/CartIndexPage.js:8:41
 import CartTable from 'main/components/Carts/CartTable';
 import { useCurrentUser } from 'main/utils/currentUser'
 
-export default function CartIndexPage() {
-
-  const currentUser = useCurrentUser();
-
-  const { data: carts, error: _error, status: _status } =
-    useBackend(
-      // Stryker disable next-line all : don't test internal caching of React Query
-      ["/api/carts/all"],
-      { method: "GET", url: "/api/carts/all" },
-      []
-    );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Carts</h1>
-        <CartTable carts={carts} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function CartIndexPage() {}
killedBy: CartIndexPage tests renders without crashing for regular user
statusReason: Error: CartIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/Carts/CartIndexPage.js:16:29
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/carts/all"],
-      { method: "GET", url: "/api/carts/all" },
+      { method: "GET", url: "" },
       []
     );
killedBy: CartIndexPage tests renders three carts without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="CartTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] StringLiteral
main/pages/Carts/CartIndexPage.js:16:17
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/carts/all"],
-      { method: "GET", url: "/api/carts/all" },
+      { method: "", url: "/api/carts/all" },
       []
     );

[Killed] ArrayDeclaration
main/pages/Carts/CartIndexPage.js:17:7
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/carts/all"],
       { method: "GET", url: "/api/carts/all" },
-      []
+      ["Stryker was here"]
     );
 
killedBy: CartIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="CartTable-cell-row-0-col-id" role="cell" /> instead
